Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetCustomConnectionTemplateUniqueId(System.Guid@)
Gets template connection unique id.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetCustomConnectionTemplateDataHash(System.Guid@)
Gets binary custom connection template data hash.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetCustomConnectionTemplateData(System.IntPtr,System.Int32)
Gets binary custom connection template data.
data:
Buffer to receive custom connection template data.
nDataSize:
Available data size.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetCustomConnectionTemplateDataSize
Gets binary custom connection template data size.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.SetCustomConnectionTemplateData(System.IntPtr,System.Int32,System.Guid,System.Guid)
Sets binary data related to custom connection template.
data:
Custom connection template data.
nDataSize:
Data size.
hash:
Custom connection template data hash.
id:
Unique id of the template.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.FindGenericConnectionType(Autodesk.Revit.DB.Document)
Finds StructuralConnectionHandlerType which is Generic Connection type.
Returns:
Returns id of StructuralConnectionHandlerType which is Generic Connection type of invalidElementId if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsTypeNameValidForCustomConnection(Autodesk.Revit.DB.Document,System.String)
Validates if the input name matches the criteria of StructuralConnectionHandlerType name.
Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\/:*?";<>| or any of the non-printable characters.
document:
The Document.
typeName:
The StructuralConnectionHandlerType name to validate.
Returns:
True if the input name matches the criteria of StructuralConnectionHandlerType name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.RemoveMainSubelementsFromCustomConnection(Autodesk.Revit.DB.Structure.StructuralConnectionHandler,System.Collections.Generic.IList{Autodesk.Revit.DB.Subelement})
Removes one or more subelements from a StructuralConnectionHandlerType. The subelements will be erased.
structuralConnectionHandler:
The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.
subelements:
The main Subelements of input StructuralConnectionHandler which are to be used to modify custom StructuralConnectionHandlerType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input StructuralConnectionHandler must have custom type.
-or-
All the input Subelements must belong to input StructuralConnectionHandler.
After modification of StructuralConnectionHandlerType there must remain at least one subelement of structural connections category in StructuralConnectionHandler.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.AddElementsToCustomConnection(Autodesk.Revit.DB.Structure.StructuralConnectionHandler,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler by adding representors of input elements or subelements.
Remarks:
Elements or subelements added to a custom connection are deleted and transformed in subelements of the connection. They could be:
FamilyInstance (structural beams and columns).StructuralConnectionHandler elements associated to the connection.Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWeldsOST_StructConnectionHolesOST_StructConnectionModifiersOST_StructConnectionShearStudsOST_StructConnectionBoltsOST_StructConnectionAnchorsOST_StructConnectionPlates
You cannot add: elements connected by any connection handler, generic connections, holes and modifiers that are not on the connected elements.
structuralConnectionHandler:
The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.
references:
References to elements or subelements which are to be used to modify custom StructuralConnectionHandlerType by adding their representors.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input StructuralConnectionHandler must have custom type.
-or-
All the input Elements should be of the following structural categories: framings, columns, profiles, plates, bolts, anchors, shear studs, welds or structural connections.
-or-
Total number of different input elements of input StructuralConnectionHandlers must be lower or equal to 3.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.Create(Autodesk.Revit.DB.Document,System.String,System.Guid,System.String,Autodesk.Revit.DB.ElementId)
Creates a new StructuralConnectionHandlerType object.
pADoc:
The document.
name:
The type name.
guid:
Connection GUID.
familyName:
Name of system family which created type will belong to.
categoryId:
Category identity of connection type.
Returns:
The newly created instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.Create(Autodesk.Revit.DB.Document,System.String,System.Guid,System.String)
Creates a new StructuralConnectionHandlerType object.
pADoc:
The document.
name:
The type name.
guid:
Connection GUID.
familyName:
Name of system family which created type will belong to.
Returns:
The newly created instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetDefaultConnectionHandlerType(Autodesk.Revit.DB.Document)
Gets a default type id for Structural Connection.
pADoc:
The document.
Returns:
The type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.CreateDefaultStructuralConnectionHandlerType(Autodesk.Revit.DB.Document)
Creates a new StructuralConnectionHandlerType object with a default name.
pADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsDetailed
Checks if StructuralConnectionHandlerType is detailed.
Returns:
True if StructuralConnectionHandlerType is detailed.
Since:
2019

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsGeneric
Checks if StructuralConnectionHandlerType is generic.
Returns:
True if StructuralConnectionHandlerType is generic.
Since:
2019

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsCustom
Checks if StructuralConnectionHandlerType is custom.
Returns:
True if StructuralConnectionHandlerType is custom.
Since:
2019

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.ConnectionGuid
The GUID to use for identifying connection geometry generation algorithm.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType
A StructuralConnectionHandlerType is used in StructuralConnectionHandler element generation.
Since:
2017